[
  {"word": "xanax", "meaning": "Xanax", "sentence": "Xanax is a medication used to treat anxiety and panic disorders.", "turkish_translation": "Xanax, anksiyete ve panik bozukluklarını tedavi etmek için kullanılan bir ilaçtır."},
  {"word": "xbox", "meaning": "Xbox", "sentence": "The Xbox gaming console is known for its impressive graphics.", "turkish_translation": "Xbox oyun konsolu etkileyici grafikleri ile tanınır."},
  {"word": "xerox", "meaning": "xerox", "sentence": "Xerox is a brand name that has become synonymous with photocopying.", "turkish_translation": "Xerox, fotokopi çekmekle eşanlamlı hale gelen bir marka adıdır."},
  {"word": "xhtml", "meaning": "XHTML", "sentence": "XHTML is a stricter and cleaner version of HTML.", "turkish_translation": "XHTML, HTML'nin daha sıkı ve temiz bir versiyonudur."},
  {"word": "xi", "meaning": "xi", "sentence": "Xi is the 14th letter of the Greek alphabet.", "turkish_translation": "Xi, Yunan alfabesinin 14. harfidir."},
  {"word": "xl", "meaning": "xl", "sentence": "XL is often used as an abbreviation for 'extra large'.", "turkish_translation": "XL, genellikle 'extra large'ın kısaltması olarak kullanılır."},
  {"word": "xml", "meaning": "XML", "sentence": "XML is a markup language used for structuring and storing data.", "turkish_translation": "XML, veriyi yapılandırmak ve depolamak için kullanılan bir işaretleme dilidir."},
  {"word": "xp", "meaning": "XP", "sentence": "XP stands for 'eXPerience' in the context of Microsoft Windows operating systems.", "turkish_translation": "XP, Microsoft Windows işletim sistemlerinin bir bağlamında 'eXPerience' anlamına gelir."},
  {"word": "xx", "meaning": "xx", "sentence": "XX is often used as a symbol for kisses in written communication.", "turkish_translation": "XX, yazılı iletişimde öpücük sembolü olarak sıkça kullanılır."},
  {"word": "xxx", "meaning": "xxx", "sentence": "XXX is often used to represent adult content and is not suitable for all audiences.", "turkish_translation": "XXX genellikle yetişkin içeriği temsil etmek için kullanılır ve tüm izleyiciler için uygun değildir."}





]